Revit 2017 API
TableView Properties
The TableView type exposes the following members.
Properties
Name | Description
AnalysisDisplayStyleId
 Element id of Analysis Display Style associated with the view.
 (Inherited from View.)
AreAnalyticalModelCategoriesHidden
 Indicates if analytical model categories are currently hidden in the view.
 (Inherited from View.)
AreAnnotationCategoriesHidden
 Indicates if annotation categories are currently hidden in the view.
 (Inherited from View.)
AreImportCategoriesHidden
 Indicates if import categories are currently hidden in the view.
 (Inherited from View.)
AreModelCategoriesHidden
 Indicates if model categories are currently hidden in the view.
 (Inherited from View.)
ArePointCloudsHidden
 Indicates if point clouds are currently hidden in the view.
 (Inherited from View.)
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
AssociatedAssemblyInstanceId
 The Id of the assembly instance that owns the assembly view.
 (Inherited from View.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CanBePrinted
Test whether the view can be printed.
 (Inherited from View.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
CropBox
The Crop Box applied to the view, or an outline encompassing the crop region applied to the view.
 (Inherited from View.)
CropBoxActive
Whether or not the Crop Box/Region is active for the view.
 (Inherited from View.)
CropBoxVisible
Whether or not the Crop Box/Region is visible for the view.
 (Inherited from View.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
DetailLevel
 The detail level of this view.
 (Inherited from View.)
Discipline
 The Discipline of the view.
 (Inherited from View.)
DisplayStyle
 The DisplayStyle of the view. Returns DisplayStyle.Wireframe if the view has no display style.
 (Inherited from View.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
GenLevel
The level for the view.
 (Inherited from View.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsAssemblyView
 Indicates if the view is assembly view.
 (Inherited from View.)
IsTemplate
Test whether the view is a view template.
 (Inherited from View.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MaximumColumnWidth
 Gets the maximum column width
MaximumGridWidth
 Gets the allowed maximum grid width
MaximumRowHeight
 Gets the maximum row height
MinimumColumnWidth
 Gets the minimum column width
MinimumRowHeight
 Gets the minimum row height
Name
A human readable name for the Element.
 (Inherited from Element.)
Origin
Returns the origin of the screen.
 (Inherited from View.)
Outline
The bounds of the view in paper space (in inches).
 (Inherited from View.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
PartsVisibility
 The visibility setting for parts in this view.
 (Inherited from View.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
RevealConstraintsMode
 Indicates whether the Reveal Constraints mode is activated in the view.
 (Inherited from View.)
RightDirection
The direction towards the right side of the screen.
 (Inherited from View.)
Scale
The scale of the view.
 (Inherited from View.)
ShadowIntensity
 The intesity of cast shadows - 0 = no shadows, 100 = black.
 (Inherited from View.)
SketchPlane
The sketch plane assigned to the view for model curve creation.
 (Inherited from View.)
SunAndShadowSettings
The sun and shadow settings assigned to the view for shadow calculation and rendering.
 (Inherited from View.)
SunlightIntensity
 The intensity of the simulated (directional) sunlight. 0 = no directional light; maximum value is 100.
 (Inherited from View.)
TargetId
 the element id of the element that is being viewed
TemporaryViewModes
 Data of temporary view modes associated with this view.
 (Inherited from View.)
Title
 The view title. This consists of the view name plus other modifiers, such as the view type, sheet number, area scheme, and/or assembly type, depending on the specifics of the view.
 (Inherited from View.)
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UpDirection
The direction towards the top of the screen.
 (Inherited from View.)
ViewDirection
The direction towards the viewer.
 (Inherited from View.)
ViewName
The name of the view.
 (Inherited from View.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
ViewTemplateId
 The id of the template view that controls this view's parameters.
 (Inherited from View.)
ViewType
The type of the view.
 (Inherited from View.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
TableView Class
Autodesk.Revit.DB Namespace